{
  "nodes": [{
    "node": 0,
    "name": "Sheriff Woody",
    "summary": "A good-hearted cowboy doll who belongs to a young boy named Andy.",
    "avatar": "http://vignette3.wikia.nocookie.net/disney/images/a/ab/Woody_4.png/revision/latest/scale-to-width-down/270?cb=20160602005758"
  }, {
    "node": 1,
    "name": "Buzz Lightyear",
    "summary": "A spaceman action figure. A new present for Andy.",
    "avatar": "http://vignette4.wikia.nocookie.net/disney/images/d/d6/Buzz_lightyear_pose.jpg/revision/latest/scale-to-width-down/516?cb=20141203033730"
  }, {
    "node": 2,
    "name": "Andy",
    "summary": "An imaginative boy who lives with his mother and sister Molly; his father is never seen in the films and supplementary materials indicate that he has passed away prior to the events of the first movie. He is 6 years old in his debut, and is the owner of Woody, Buzz Lightyear, and the other toys, which he treats with a large amount of love.",
    "avatar": "http://vignette4.wikia.nocookie.net/disney/images/0/04/Andy_medium.png/revision/latest/scale-to-width-down/270?cb=20140820144933"
  }, {
    "node": 3,
    "name": "Little Bo Peep",
    "summary": "She is inspired by character of the classic children's nursery rhyme Little Bo-Peep. Bo is sometimes considered to be 'Andy's toy', because Andy likes to make her the damsel in distress of his plays.",
    "avatar": "http://vignette1.wikia.nocookie.net/disney/images/5/5b/Bo_Peep_backdrop.png/revision/latest?cb=20160719014215"
  }, {
    "node": 4,
    "name": "Mr. Potato Head",
    "summary": "A moody, crabby Humpty Dumpty-like toy based on the Playskool toy of the same name",
    "avatar": "http://vignette2.wikia.nocookie.net/disney/images/2/26/Mr._Potato_Head.png/revision/latest/scale-to-width-down/270?cb=20160214155918"
  }, {
    "node": 5,
    "name": "Mrs. Davis",
    "summary": "the single mother of Andy and Molly Davis. A very loving and devoted parent who establishes fair rules for her children. However, like any parent, she often argues with Andy and Molly.",
    "avatar": "http://vignette3.wikia.nocookie.net/disney/images/c/c7/Char_13236.jpg/revision/latest?cb=20140105220556"
  }, {
    "node": 6,
    "name": "Molly",
    "summary": "The pretty little sister of Andy. Like her brother, she ages between each of her appearances",
    "avatar": "http://vignette4.wikia.nocookie.net/disney/images/7/7f/Molly.jpg/revision/latest/scale-to-width-down/270?cb=20160903210838"
  }, {
    "node": 7,
    "name": "Hamm",
    "summary": "A wisecracking piggy bank. He and Mr. Potato Head appear to be best friends, as they are often seen playing games and high-fiving each other whenever something spectacular happens.",
    "avatar": "http://vignette2.wikia.nocookie.net/disney/images/3/35/Hamm_1.png/revision/latest/scale-to-width-down/270?cb=20160531221931"
  }, {
    "node": 8,
    "name": "Sarge",
    "summary": "He and the Bucket 'O' Soldiers are set in particular positions. They are highly disciplined with a 'leave no man behind' policy and are masters of reconnaissance.",
    "avatar": "http://vignette3.wikia.nocookie.net/disney/images/e/e6/SargeTS3.jpg/revision/latest/scale-to-width-down/516?cb=20100822192127"
  }, {
    "node": 9,
    "name": "Slinky",
    "summary": "Depicted as a long-suffering, abused right hand of Woody, and was also one of the more unpopular toys among Andy's collection",
    "avatar": "http://vignette3.wikia.nocookie.net/disney/images/5/56/Slinky_dog.png/revision/latest?cb=20140107050744"
  }, {
    "node": 10,
    "name": "Rex",
    "summary": "He is gentle, kind, caring, and hates any kind of argument or confrontation. He also lacks intelligence and is extremely trusting and carefree. His greatest fear is that he will be replaced or abandoned, but he is usually enthusiastic about anything and everything. With his childlike demeanor and lack of self-confidence, Rex is the most innocent of all the toys, and shows the greatest desire to be loved and played with.",
    "avatar": "http://vignette3.wikia.nocookie.net/disney/images/7/71/Rex_1.png/revision/latest/scale-to-width-down/270?cb=20160531222519"
  }, {
    "node": 11,
    "name": "Scene 1",
    "summary": "We open on a little boy's bedroom where the kid in question is playing with his toys. He's moving them around and doing all their voices as he plays. There's a whole town he's set up made out of cardboard boxes with a wanted poster featuring a mean-looking Mr. Potato Head doll. Dum dum dumm. Suddenly, the Mr. Potato Head doll jumps into view and points a (toy) gun at some other toys and demands they open the safe (an adorable pink piggy bank) for him. Egads! The other toys are frightened and when a Little Bo Peep figure tries to stand up to the Mr. Potato Head, he threatens to kill her sheep. Can't anyone save them?Enter one Sheriff Woody. The boy tugs on Woody's pull cord and the cowboy tells Mr. Potato Head (also known as One-Eyed Bart) to 'reach for the sky!'' Just then, Mr. Potato Head brings out his attack dog with a built-in force field. Luckily, Woody has also remembered to bring his dinosaur who eats force field dogs. Touché, Sheriff Woody. Sheriff Woody apprehends the villainous Mr. Potato Head and throws him right into jail…otherwise known as the baby crib. The baby inside picks up the toy, drools on him a little, then smashes his head on the railing. All in a day's work for Sheriff Woody.",
    "script": "INT. ANDY'S BEDROOM\n\nA row of moving boxes lie on the floor of the room.  They\nare drawn up in crayon to look like a miniature Western town.\nThe bedroom is lined with cloud wallpaper giving the\nimpression of sky.\n\nOne of the boxes has a children's illustrated 'WANTED'\nposter of a Mr. Potato Head taped to it.\n\nA MR. POTATO HEAD DOLL is set in front of the poster.  The\nVOICE OVER of ANDY, a 6-year-old boy, can be heard acting\nout all the voices of the scene.\n\n                         ANDY (AS POTATO HEAD)\n            Alright everyone, this is a stick-\n            up!  Don't anybody move!  Now empty\n            that safe!\n\nA GROUP OF TOYS have been crowded together in front of the\n'BANK' box.\n\nAndy's hand lowers a CERAMIC PIGGY BANK in front of Mr.\nPotato Head and shakes out a pile of coins to the floor.  Mr.\nPotato Head kisses the coins.\n\n                         ANDY (AS POTATO HEAD)\n            Ooh!  Money.  Money.  Money.\n                   (kissing noises)\n\n\nA porcelain figurine of the shepherdess, BO PEEP, is brought\ninto the scene.\n\n                         ANDY (AS BO PEEP)\n            Stop it!  Stop it, you mean old\n            potato!\n\n                         ANDY (AS POTATO HEAD)\n            Quiet Bo Peep, or your sheep get\n            run over!\n\nThe companion porcelain sheep are placed in the center of a\nHot Wheels track loop.\n\n                         ANDY (AS SHEEP)\n            Heeeeelp!  BAAAAA!  Heeeelp us!\n\n                         ANDY (AS BO PEEP)\n            Oh, no!  Not my sheep!  Somebody do\n            something!\n\nWOODY, a pull-string doll cowboy, enters into the scene\nopposite the inanimate spud.\n\nAndy's hand pulls on the ring in the center of Woody's back.\n\n                         WOODY (VOICE BOX)\n            Reach for the sky.\n\n                         ANDY (AS POTATO HEAD)\n            Oh, no!  Sheriff Woody!!\n\n                         ANDY (AS WOODY)\n            I'm here to stop you, One-Eyed Bart.\n\nAndy's hand pulls out one of Mr. Potato Head's eyes.\n\n                         ANDY (AS POTATO HEAD)\n            Doooooh!  How'd you know it was me!\n\n                         ANDY (AS WOODY)\n            Are you gonna come quietly?\n\n                         ANDY (AS POTATO HEAD)\n            You can't touch me Sheriff!  I\n            brought my attack dog with a built-\n            in force field!\n\nAndy places a TOY DOG, with a SLINKY for a mid-section, in\nfront of Mr. Potato Head and stretches him out.\n\n                         ANDY (AS WOODY)\n            Well I brought my DINOSAUR, who\n            eats force field dogs!!\n\nAndy reveals a PLASTIC TYRANNOSAURUS REX, who stomps on the\nSlinky Dog.\n\n                         ANDY (AS DINOSAUR)\n            AAAAR!  ROAR-ROAR-ROAR!\n\n                         ANDY (AS SLINKY DOG)\n            YIPE!  YIPE-YIPE-YIPE!\n\n                         ANDY (AS WOODY)\n            You're goin' to jail, Bart.\n\nAndy picks up Mr. Potato Head and places him in a baby crib\nin the room.\n\nA cardboard sign is taped to the bars with the word 'JAIL'\nwritten in crayon.\n\n                         ANDY (AS WOODY)\n            Say good-bye to the wife and\n            tatertots.\n\nAndy's 1-year-old sister, MOLLY, crawls over and picks up Mr.\nPotato Head.  She sucks on him for a beat then proceeds to\npound the toy repeatedly against the rail of her crib,\nforcing some of his parts loose.\n\nAndy, wearing a cowboy hat himself, picks up Woody off the\nfloor.\n\n                         ANDY\n                   (pulling Woody's string)\n            You saved the day again, Woody.\n\n                         WOODY (VOICE BOX)\n            You're my favorite deputy."
  }, {
    "node": 12,
    "name": "Scene 2",
    "summary": "The opening credit roll and the song 'You've Got a Friend in Me' (we think you've heard that one) plays as Woody and the little boy hang out together. They pretend to rope cattle, ride cars, slide down the banister on the staircase, and Woody even goes flying across the room thanks to the recliner on the La-Z-Boy in the living room. When Woody lands, we see he has the name 'Andy' written on the bottom of one of his shoes. That's the name of the kid. Downstairs, Andy sees his mom setting up for his birthday party. Andy asks if they can leave all the decorations up until they move to their new house… oh, this family is moving? That seems like an important plot point for later on.Andy's mom tells him to go upstairs and get his little sister, Molly, out of the crib so they can get their party on. (That's the baby from before who drooled on poor Mr. Potato Head). Upstairs in his room, Andy tosses Woody on his bed, and then goes downstairs to celebrate, eat some cake, and get some new gifts. Hmmm…",
    "script": "BEGIN TITLES\n\nSONG 'YOU'VE GOT A FRIEND IN ME' plays while Andy does\nvarious activities with Woody:\n\n-- Andy turns the Western town boxes around to reveal cows\ndrawn on the other side.  He grabs a jump rope and pretends\nWoody is lassoing the cattle.\n\n                         ANDY\n            C'mon, let's wrangle up the cattle.\n\n-- Andy then rides Woody around on an RC (remote control)\ncar, and herds the remaining 'cow' boxes under Molly's crib.\n\nINT. STAIRWELL\n\n-- Andy places Woody on the top of the stairwell banister\nallowing the doll to slide downstairs.  Andy races ahead and\ncatches him at the bottom.\n\nINT. DOWNSTAIRS LIVING ROOM\n\n-- Andy & Woody fall into the La-Z-Boy chair and spin around\nand around.\n\nNext, Andy uses the La-Z-Boy foot rest as a catapult.\n\nAndy flings Woody across the room to the sofa.\n\n                         ANDY\n                   (raising his arms)\n            Score!\n\nSONG ENDS\n\nWoody lies limp on the sofa while Andy is heard talking to\nhis mother.\n\n                         ANDY (O.S.)\n            Wow!  Cool!\n\n                         MRS. DAVIS (O.S.)\n            Whadda ya think?\n\n                         ANDY (O.S.)\n            Oh, this looks GREAT, Mom!\n\nANGLE: THE ADJOINING DINING ROOM\n\nMRS. DAVIS, Andy's thirty eight-year-old mom, has just\nfinished decorating the area with streamers and balloons.  A\nbanner is draped across the archway.  It reads: 'Happy\nBirthday Andy.'\n\nWoody's frozen face stares in the direction of the birthday\ndecorations.\n\n                         ANDY\n            Can we leave this up 'til we move?\n\n                         MRS. DAVIS\n            Well, sure, we can leave it up.\n\n                         ANDY\n            Yeah!\n\n                         MRS. DAVIS\n            Now go get Molly.  Your friends are\n            going to be here any minute.\n\n                         ANDY\n            Okay.\n\nAndy picks up Woody from the couch and runs upstairs.\n\n                         ANDY\n            It's party time, Woody!\n\nINT. ANDY'S BEDROOM - CONTINUOUS\n\nAndy and Woody enter the room.  Molly is still banging\nPotato Head against her crib railing.  Andy tips Woody's hat\nat her.\n\n                         ANDY\n            Howdy, Little Lady!\n\nHe deposits Woody on the bed and pulls his string one last\ntime.\n\n                         WOODY (VOICE BOX)\n            Somebody's poisoned the waterhole.\n\n                         ANDY\n                   (picking up Molly)\n            C'mon, Molly.  Oh, you're getting\n            heavy!\n                   (to Woody)\n            See ya later, Woody.\n\nAndy exits."
  }, {
    "node": 13,
    "name": "Scene 3",
    "summary": "As soon as Andy leaves his room, his toy cowboy starts to move. What? Woody shakes himself awake and then starts to worry about Andy's birthday party. He didn't know it was going to be today. Woody shouts that the coast is clear and, slowly, the entire bedroom filled with Andy's toys wakes up. They start walking, talking, and moving all over the place. (This movie could so very easily have been a horror movie, a la Chucky.) In only about a minute, we meet several other toys—in addition to Mr. Potato Head, there's the piggy bank, named Hamm, a little green army man named Sarge, and an Etch-a-Sketch that's really good at drawing. The dog from before is named Slinky and the dinosaur is Rex. Woody starts to gather up all the toys for a quick staff meeting. He may have some bad news, but he's not acting like it for now. Right before he goes up to talk to the other toys, the Little Bo Peep figure strolls up to Woody and thanks him for saving her sheep. Maybe he'd like her to find someone else to look after her flock tonight. Wink, wink. Woody's blushing. We didn't know toys could blush. But, to be fair, we also didn't know toys could move and talk and form romantic attachments.",
    "script": "Woody's eyes come to life.  The cowboy doll sits up, his\nexpression changing from a smile to worry.\n\n                         WOODY\n                   (to himself)\n            Pull my string!  The birthday\n            party's today?!\n\nWoody thinks.\n\n                         WOODY\n                   (to the room)\n            Okay, everybody.  Coast is clear.\n\nThe bedroom comes alive.  TOYS emerge from the toy box, the\ncloset, the shelves, etc... in a flurry of activity.\n\nPOTATO HEAD, his body parts strewn across the floor, sits\nhimself upright and begins to re-assemble himself.\n\n                         MR. POTATO HEAD\n            Ages three and up.  It's on my box.\n            Ages three and up!  I'm not\n            supposed to be babysitting Princess\n            Drool.\n\nHAMM, the piggy bank, flips one last penny into his coin\nslot.  Potato Head walks up to him.  All his facial pieces\nare in the wrong slots.\n\n                         MR. POTATO HEAD\n            Hey, Hamm!  Look!  I'm Picasso!\n                         HAMM\n            I don't get it.\n\nHamm walks away.\n\n                         MR. POTATO HEAD\n            You uncultured swine!\n                   (to someone O.S.)\n            What are you looking at, ya hockey\n            puck?!\n\nPotato Head walks past, revealing a hockey puck figurine.\n\nWoody sits on the edge of the bed observing all the activity.\nHe turns to a plastic green army man, SARGENT, standing on\nthe night stand.\n\n                         WOODY\n            Uh, hey Sarge, have you seen Slinky?\n\n                         SARGENT\n                   (saluting)\n            Sir!  No Sir!\n\n                         WOODY\n            Okay, thank you.  At ease.\n\nWoody hops off the bed.\n\n                         WOODY\n            Hey, Slinky?\n\n                         SLINKY (O.S.)\n            Right here, Woody!\n\nA toy Slinky dog, SLINKY, appears from under the bed pushing\nout a checker board set.  He begins to place the checkers on\nthe board.\n\n                         SLINKY\n            I'm red this time.\n\n                         WOODY\n            No, Slink --\n\n                         SLINKY\n            Oh...well alright, you can be red\n            if you want.\n\n                         WOODY\n            Not now, Slink.  I've got some bad\n            news.\n\n                         SLINKY\n            Bad news?!\n\n                         WOODY\n            Sh-h-h-h-h!!\n\nWoody covers up Slinky's mouth, aware that the other toys in\nthe room are watching.  He leans in close to Slinky.\n\n                         WOODY\n                   (whispering)\n            Just gather everyone up for a staff\n            meeting and be happy!!\n\n                         SLINKY\n            Got it.\n\nSlinky shuffles off.\n\n                         WOODY\n            Be HAPPY!\n\nSlinky perks up his gait and LAUGHS HARD.\n\nWoody proceeds in the other direction.  He passes a toy\nROBOT and SNAKE partially hidden under the bedspread.\n\n                         WOODY\n                   (to the room)\n            Staff meeting, everybody.\n                   (aside)\n            Snake, Robot -- podium duty.\n\nRobot and Snake come out from under the bed and reluctantly\nfollow Woody.\n\nWoody walks past an Etch-A-Sketch, ETCH, going the other\ndirection.\n\n                         WOODY\n            Hey Etch!  Draw!\n\nBoth Etch and Woody whip around like gunfighters.\n\nBefore Woody can fully extend his arm out, the Etch-A-Sketch\netches a gun on its screen.\n\n                         WOODY\n                   (pretending to be shot)\n            Oh!! You got me again, Etch! You've\n            been working on that draw.  Fastest\n            knobs in the west.\n\nSlinky passes a group of toys on the floor.\n\n                         SLINKY\n            Got a staff meeting, you guys, come\n            on, let's go!\n\nRobot and Snake begin constructing a podium made out of\nLegos and a Tinker Toy tub while Woody searches the floor.\n\n                         WOODY\n            Now where is that -- ?  Aw, hey,\n            who moved my doodle pad way over here?\n\nWoody spots the doodle pad on the floor by the desk and\nwalks over to it.  As he reaches down to pick it up...\n\nREX, the plastic dinosaur, jumps out to scare Woody.\n\n                         REX\n            ROOAAAARR!!!\n\n                         WOODY\n                   (unaffected)\n            Oh, how ya doin', Rex?\n\nRex suddenly turns timid.\n\n                         REX\n            Were you scared?  Tell me honestly.\n\n                         WOODY\n            I was close to being scared that time.\n\nWoody heads back to the podium.  Rex follows.\n\n                         REX\n            I'm going for fearsome here, but I\n            just don't feel it.  I think I'm\n            just coming off as annoying.\n\nA crook suddenly grabs Woody's neck and jerks him towards BO\nPEEP, the porcelain figurine.\n\n                         WOODY\n                   (choking)\n            Aach! -- Oh, hi, Bo.\n\n                         BO PEEP\n            I wanted to thank you, Woody, for\n            saving my flock.\n\n                         WOODY\n                   (blushing)\n            Oh, hey - it was nothing.\n\n                         BO PEEP\n            Whadda ya say I get someone else to\n            watch the sheep tonight?\n\n                         WOODY\n                   (very flustered)\n            Heh, heh...oh yeah, uh, I...\n\nBo saunters back towards her lamp stand, passing a stack of\nABC blocks.\n\n                         BO PEEP\n            Remember, I'm just a couple of\n            blocks away.\n\nWoody is left lovestruck.\n"
  }, {
    "node": 14,
    "name": "Scene 4",
    "summary": "Woody steps up in front of a tub of Tinkertoys and speaks into a toy microphone to address the whole group of Andy's toys. He reminds them, first and foremost, to pick a moving buddy. The other toys aren't super concerned, but this move is in one week and Woody doesn't want any toys getting left behind. Woody's final announcement, which he tries to downplay, is that Andy's birthday party is today. The other toys start losing their minds—Andy's real birthday isn't for a week. Woody tries to calm everyone down. It will be fine. These new toys aren't going to replace them. No worries, people. That's easy for Woody to say, Mr. Potato Head tells everyone, he's been Andy's favorite toy since kindergarten. But, Slinky sticks up for Woody. If Woody says it's all good, it must be. Okay, we're sensing some tension in toyland. Woody reminds them that they all freak out about this every birthday and Christmas. It doesn't matter if Andy gets new toys or plays with them less. They're Andy's toys and it's their job to be there for him when the boy needs them. Suddenly, Hamm sees birthday guests arriving…and they're carrying a whole lot of packages. Eeek. The toys are panicking, so Woody agrees to send some little green army men downstairs to scout the situation. Everyone can calm down a little bit. Smart thinking, Sheriff. Way to take charge.",
    "script": "All the rest of the toys in the room are filing past Slinky.\n\n                         SLINKY\n            Come on, come on!  Smaller toys up\n            front.\n\nWoody remains lovestruck in the middle of the room.\n\n                         SLINKY\n            Hey, Woody!  C'mon!\n\nWoody snaps out of his trance and rushes over to the podium.\n\nThe toys crowd together as Woody steps up to the podium.\nMIKE, a toy tape recorder, waddles up next to Woody and\nindicates his microphone.\n\n                         MIKE\n            Ahem!\n\n                         WOODY\n                   (grabbing microphone)\n            Oh, thanks, Mike.\n                   (to the crowd)\n            Okay --\n\nSFX: FEEDBACK\n\n                         WOODY\n                   (to Mike)\n            Oh, whoa, step back --\n\nMike waddles back a step to stop the feedback.\n\n                         WOODY\n            Hello?  Check?  Better?  Great.\n            Everybody hear me?  Up on the\n            shelf, can you hear me?  Great!\n            Okay, first item today...oh, yeah.\n            Has everyone picked a moving buddy?\n\nThe toys all MOAN.\n\n                         HAMM\n            Moving buddy?!  You can't be serious!\n\n                         REX\n            Well I didn't know we were supposed\n            to have one already.\n\n                         MR. POTATO HEAD\n                   (waving his arm out\n                   its socket)\n            Do we have to hold hands?\n\nThe toys LAUGH and SNICKER.\n\n                         WOODY\n            Oh, yeah, you guys think this is a\n            big joke.  We've only got one week\n            left before the move.  I don't want\n            any toys left behind.  A moving\n            buddy -- if you don't have one, get\n            one!\n                   (checking the pad)\n            Alright, next...uh...oh, yes.\n            Tuesday night's 'Plastic Corrosion\n            Awareness' meeting was, I think, a\n            big success and we want to thank Mr.\n            Spell for putting that on for us.\n            Thank you, Mr. Spell.\n\nThe words 'You're welcome' scroll across Mr. Spell's display\nscreen as he speaks.\n\n                         MR. SPELL\n            You're welcome.\n\n                         WOODY\n            Ok, uh...oh yes.  One minor note\n            here...\n                   (under his breath)\n            Andy's birthday party's been moved\n            to today.\n                   (full voice)\n            Next we have --\n\nThe toys all PANIC.\n\n                         REX\n            What?!  Whadda ya mean, the party's\n            today?!  His birthday's not 'til\n            next week!!\n\n                         HAMM\n            What's going on down there?  Is Mom\n            losing her marbles?!\n\n                         WOODY\n            Well, obviously she wanted to have\n            the party before the move.  I'm not\n            worried.  You shouldn't be worried.\n\n                         MR. POTATO HEAD\n            Of course Woody ain't worried!\n            He's been Andy's favorite since\n            kindergarten!\n\n                         SLINKY\n            Hey, hey!  Come on, Potato Head!\n            If Woody says it's all right, then,\n            well, darnit, it's good enough for\n            me.  Woody has never steered us\n            wrong before.\n\nWhile Slinky speaks, Potato Head takes off his mouth and\nmimes kissing his own butt.\n\n                         WOODY\n            C'mon, guys!  Every Christmas and\n            birthday we go through this.\n\n                         REX\n            But what if Andy gets another\n            dinosaur?  A mean one?  I just\n            don't think I can take that kind of\n            rejection.\n\n                         WOODY\n            Hey, listen, no one's getting\n            replaced.  This is Andy we're\n            talking about.\n\nWoody steps down from the podium and walks towards the crowd.\n\n                         WOODY\n                   (continued)\n            It doesn't matter how much we're\n            played with.  What matters is that\n            we're here for Andy when he needs\n            us.  That's what we're made for.\n            Right?\nEveryone is now looking down, sheepish.\n\n                         HAMM\n            Pardon me.  I hate to break up the\n            staff meeting, but THEY'RE HERE!\n            Birthday guests at three o'clock!\n\n                         WOODY\n            Stay calm, everyone!!\n\nToo late.  The toys PANIC and stampede over Woody towards\nthe bedroom window, leaving him alone on the floor.\n\n                         WOODY\n            Uh, meeting adjourned.\n\nThe toys all crowd around the bedroom window, trying to get\na peek outside.\n\n                         HAMM\n            Oh, boy.  Will ya take a look at\n            all those presents?!\n\n                         MR. POTATO HEAD\n            I can't see a thing!\n\nUnable to see over the crowd, Potato Head pulls his eyes out\nof his head and holds them up over the other toys.\n\nANGLE: TOY'S POV OF ANDY'S FRONT YARD\n\nCHILDREN file towards the front door carrying presents.\n\n                         HAMM\n            Yessir, we're next month's garage\n            sale fodder for sure.\n\n                         REX\n                   (panicked)\n            Any dinosaur-shaped ones?\n\n                         HAMM\n            Ah, for crying out loud, they're\n            all in boxes, you idiot!\n\nThe presents keep coming.\n\n                         REX\n            They're getting bigger.\n\n                         SLINKY\n            Wait!  There's a nice little one\n            over there!\n\nAt first, the kid's present appears to be a little box, but\nthen the kid turns -- the present is four feet long.  The\ntoys SCREAM.\n\n                         MR. SPELL\n            Spell the word 'trashcan.'\n\n                         REX\n            We're doomed!\n\nDown on the floor, Woody smacks his hand to his forehead in\nsurrender.\n\n                         WOODY\n            Alright!  Alright!\n\nThe toys turn inside and look down at Woody.\n\n                         WOODY\n                   (continued)\n            If I send out the troops, will you\n            all calm down?\n\n                         REX\n            Yes!  Yes!  We promise!\n\n                         WOODY\n            Okay, save your batteries!\n\n                         HAMM\n            Eh, very good, Woody.  That's using\n            the old noodle.\n\nWoody jumps up onto Andy's bed and turns to the Sargent on\nthe nightstand.\n\n                         WOODY\n            Sargent.  Establish a recon post\n            downstairs.  Code red.  You know\n            what to do.\n\n                         SARGENT\n            Yes SIR!\n\nThe green army man hops down to the floor where a 'BUCKET O'\nSOLDIERS' sits.\n\n                         SARGENT\n            Alright men, you heard him.  Code\n            Red!  Repeat: We are at Code Red!\n            Recon plan Charlie.  Execute!\n            Let's move move move!!\n\nTHE GREEN ARMY MEN file out of the bucket and march in\nformation across the bedroom floor.\n"
  }, {
    "node": 15,
    "name": "Scene 5",
    "summary": "Woody sends Sarge downstairs with the other little green army men. They're on a mission. The army men grab Molly's baby monitor and creep downstairs. It's a long and complicated mission getting past Andy's mom and the other birthday guests. There are even a few casualties. But, finally the soldiers make it into a houseplant. Upstairs, the other toys are listening at the other end of the baby monitor for Sarge and his troops to radio up what presents have been opened. Andy opens lots of presents—a lunchbox, bed sheets, a board game—but there are no flashy new toys to threaten the old crew. Phew. But, wait—Andy's mom pulls a surprise present out of the closet. Everyone gets excited. Oh, no. Kids are standing in the way so Sarge can't see what's being opened. The toys upstairs are in chaos and, in the confusion, they knock the baby monitor over and the batteries fly out. Meanwhile, Andy runs upstairs to his room with his friends and his new toy. The toys rush to get back to their places as kids stomp up the stairs. All his friends are super excited and Andy makes room on the bed by brushing Woody to the floor and putting his new toy in Woody's place of honor. Ouch. That one hurt. Andy's mom calls the boys downstairs for games and they all go running. Seriously, what is this fancy new toy everyone's so psyched about?",
    "script": "INT. UPSTAIRS HALLWAY\n\nAndy's door creaks open and a lone army man ventures forth\nto make sure the coast is clear.  Satisfied, he motions for\nthe others to proceed.  Squads of soldiers march into the\nhall carrying a baby monitor and a jump rope.\n\nThe army men each leapfrog behind the stairway banisters and\nhold their positions while the Sargent surveys the scene\nbelow through his binoculars.\n\nANGLE: SARGENT'S BINOCULAR VIEW OF DOWNSTAIRS\n\nDirectly below, Mrs. Davis passes through the hallway\nrounding up Andy and all his birthday guests.\n\n                         MRS. DAVIS\n            Okay, c'mon kids!  Everyone in the\n            living room.  It's almost time for\n            the presents.\n\nOnce Mrs. Davis and the children are out of sight, the\nSargent motions to his men with a silent hand signal.\n\nTWO PARATROOPERS jump out through the railing, parachuting\ndown to the floor below.\n\nINT. DOWNSTAIRS HALLWAY - CONTINUOUS\n\nThe paratroopers sweep the area with their plastic rifles,\nthen give the 'all clear' sign.\n\nThe jump rope is lowered, and more soldiers rappel down.\n\nINT. ANDY'S BEDROOM\n\nThe toys race towards the nightstand where Woody has placed\nthe receiving half of the baby monitor.\n\n                         WOODY\n            And this --\n                   (turning on the baby monitor)\n            -- is how we find out what is in\n            those presents.\n\nINT. DOWNSTAIRS HALLWAY\n\nThe green army men march in formation across the floor when\nsuddenly...\n\nSFX: FOOTSTEPS\n\nCan be heard approaching from behind the connecting kitchen\ndoor.  Immediately the Sargent signals for his men to freeze\nin their various classic action poses.\n\n                         MRS. DAVIS (O.S.)\n            Okay, who's hungry?  Here come the\n            chips.  I've got Cool Ranch and\n            Barbeque --\n\nThe door opens and Mrs. Davis' foot comes down hard on top\nof a soldier.\n\n                         MRS. DAVIS\n            Owww!  What in the world -- ?  Oh,\n            I thought I told him to pick these up.\n\nWith a sweep of her foot, she brushes the army men out of\nher path and continues on to the living room.\n\nINT. ANDY'S BEDROOM\n\n                         REX\n            Shouldn't they be there by now?\n            What's taking them so long?!\n\n                         WOODY\n            Hey, these guys are professionals.\n            They're the best.  C'mon, they're\n            not lying down on the job.\n\nINT. DOWNSTAIRS HALLWAY\n\nAs soon as Mom is gone, the Sargent motions for his men to\nproceed toward a nearby houseplant that looks into the\nliving room.\n\nThe Sargent then notices an injured soldier struggling to\ndrag himself forward -- a casualty of Mrs. Davis' foot.  The\nSargent helps the injured soldier to his feet.\n\n                         WOUNDED SOLDIER\n                   (moans)\n            Go on without me.  Just go!\n\n                         SLINKY\n            A good soldier never leaves a man\n            behind.\n\nThe Sargent motions to the remaining men above.  They lower\nthemselves via jump rope, riding the baby monitor.  Once\ndownstairs, they hustle the baby monitor towards the\nhouseplant.  Suddenly...\n\nA BALL\n\nbounces into the hallway, followed by the sound of footsteps\nand kid clamor.\n\nThe Sargent, supporting his wounded man, reaches the plant,\nright on the heels of the squad with the baby monitor.  They\nconceal themselves in the house plant just before the\nchildren run by.\n\nINT. DOWNSTAIRS - HOUSE PLANT - CONTINUOUS\n\nWhile the baby monitor is set in place, A MEDIC evaluates\nthe wounded soldier and gives the 'thumb's up' signal.\n\nThe Sargent scans the party with his binoculars.\n\nANGLE: BINOCULAR VIEW OF BIRTHDAY PRESENTS\n\nThe pile of brightly wrapped gifts sits atop the living room\ncoffee table.\n\n                         SARGENT (O.S.)\n            There they are.\n\nINT. ANDY'S BEDROOM\n\nThe toys perk up as STATIC suddenly emits from the baby\nmonitor.\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Come in, Mother Bird, this is Alpha\n            Bravo.\n\n                         WOODY\n            This is it!  This is it!  Quiet,\n            quiet, quiet!\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Come in, Mother Bird.\n            Alright...Andy's opening the first\n            present now.\n\n                         MR. POTATO HEAD\n                   (chanting)\n            Mrs. Potato Head...Mrs. Potato\n            Head...Mrs. Potato Head...\n                   (off Rex's look)\n            Hey, I can dream, can't I?\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            The bow's coming off...he's ripping\n            the wrapping paper...it's\n            a...it's...it's a lunchbox!  We've\n            got a lunchbox, here!\n\n                         WOODY\n            A lunchbox?!\n\n                         MR. POTATO HEAD\n            A lunchbox...?!\n\n                         SLINKY\n            For lunch.  Heh heh heh...\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Ok, second present...it appears to\n            be...okay, it's bed sheets.\n\n                         MR. POTATO HEAD\n            Who invited THAT kid?!\n\nINT. LIVING ROOM\n\nANGLE: BINOCULAR VIEW OF PRESENTS\n\n                                          MATCH DISSOLVE TO:\n\nANGLE: BINOCULAR VIEW OF A SINGULAR PRESENT\n\n                         MRS. DAVIS\n            Oh, only one left.\n\nINT. ANDY'S BEDROOM\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Okay, we're on the last present now...\n\n                         WOODY\n            Last present!\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            It's a big one...It's a...it's a\n            boardgame!  Repeat!  Battleship --\n            Battleship, the boardgame!\n\nThe toys CHEER WITH RELIEF.\n\n                         HAMM\n            Yeah, alright!!\n\nHamm gives Potato Head a congratulatory pat on the back,\nsending his facial features flying.\n\n                         MR. POTATO HEAD\n            Hey, watch it!\n\n                         HAMM\n            Sorry there, old Spudhead.\n\nINT. DOWNSTAIRS - HOUSE PLANT\n\n                         SARGENT\n                   (to army men)\n            Mission accomplished.  Well done,\n            men.  Pack it up, we're going home.\n\nINT. ANDY'S BEDROOM\n\n                         WOODY\n            So did I tell ya?  Huh?  Nothing to\n            worry about.\n\n                         SLINKY\n            I knew you were right all along,\n            Woody.  Never doubted you for a\n            second.\n\nINT. DOWNSTAIRS - HOUSE PLANT\n\nThe platoon is preparing to exit the plant when...\n\n                         MRS. DAVIS (O.S.)\n            Wait a minute.  Oooh, what do we\n            have here?!\n\nThe Sargent lifts his binoculars back to his eyes.\n\nANGLE: BINOCULAR VIEW OF LIVING ROOM\n\nMrs. Davis can be seen opening the closet and pulling out\nanother large present.\n\n                         SARGENT\n                   (indicating the baby monitor)\n            Wait -- turn that thing back on!\n\nINT. ANDY'S BEDROOM - CONTINUOUS\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Come in, Mother Bird, come in,\n            Mother Bird.\n\nAll the toys tense up.\n\n                         SARGENT (O.S.)\n                   (continued)\n            Mom has pulled a surprise present\n            from the closet.  Andy's opening it...\n\nINT. DOWNSTAIRS - HOUSE PLANT - CONTINUOUS\n\n                         SARGENT\n            He's really excited about this one.\n            It's a huge package.  Oh -- get\n            out -- one of the kids is in the\n            way, I can't see...\n\nINT. ANDY'S BEDROOM - CONTINUOUS\n\n                         SARGENT (O.S.)\n                   (from monitor)\n            ...it's...it's a --\n\nThe sound of children CHEERING emits from the monitor,\ncutting off the Sargent.\n\n                         REX\n            It's a WHAT?! WHAT IS IT?!!!\n\nRex grabs a leg of the nightstand and shakes it, making the\nmonitor drop to the floor.  The impact causes the batteries\nto roll out.\n\n                         REX\n            Oh, no!\n\n                         MR. POTATO HEAD\n            Oh, ya big lizard!  Now we'll never\n            know what it is!\n\n                         HAMM\n                   (sarcastic)\n            Way to go, Rex.\n\nEveryone rushes to the fallen monitor.  Potato Head tries to\ncorrectly insert the batteries.\n\n                         WOODY\n            No, no!  Turn 'em around, turn 'em\n            around!\n\n                         HAMM\n            Eh, he's puttin' 'em in backwards!\n\n                         WOODY\n            Plus is positive, minus is negative!\n            Oh, let me!\n\nWoody jumps down off the bed and shoves both Hamm and Potato\nHead aside.\n\nINT. LIVING ROOM\n\n                         ANDY\n            Let's go to my room, guys!\n\nThe kids rush past the houseplant.\n\n                         SARGENT\n                   (into the monitor)\n            RED ALERT!  RED ALERT!  ANDY IS\n            COMING UPSTAIRS!\n\nINT. ANDY'S BEDROOM - CONTINUOUS\n\nWoody puts the last battery back in.\n\n                         WOODY\n            There.\n\n                         SARGENT (O.S.)\n                   (over monitor)\n            Juvenile intrusion!  Repeat!\n            Resume your positions NOW!\n\n                         WOODY\n            Andy's coming, everybody!  Back to\n            your places.  Hurry!\n\nThe toys PANIC and scatter about the room.\n\n                         MR. POTATO HEAD\n            Where's my ear?  Who's seen my ear?\n            Did you see my ear?\n\n                         REX\n            Outta my way!  Here I come, here I\n            come --\n\nFrantic, Rex slams into a trashcan and falls over.\n\nEveryone scurries to their places as the KIDS' FOOTSTEPS\ngrow louder.\n\nWoody falls limp in his spot on the bed just as...\n\nAndy's bedroom door flies open and a flood of children's\nfeet rush in.\n\n                         FRIEND #1\n            Hey, look!  His lasers light up.\n                         ANDY\n            Take that, Zurg!\n\nWoody is flung off Andy's pillow and slides, unnoticed, down\nthe gap between the bed and the back wall.\n\n                         FRIEND #2\n            Quick!  Make a space!  This is\n            where the spaceship lands.\n\n                         ANDY\n            -- and you press his back and he\n            does a karate-chop action!\n\n                         MRS. DAVIS (O.S.)\n            Come on down, guys.  It's time for\n            games!  We've got prizes!\n\n                         ANDY\n            Oh, yeah!\n\nThe kids all run out as fast as they entered, SLAMMING THE\nDOOR behind them."
  }, {
    "node": 16,
    "name": "Scene 6",
    "summary": "The other toys come out from their hiding spaces to find Woody has been pushed off the bed and the new toy's sitting in his spot. Woody's still trying to play it cool. Nothing has changed: he'll just go up and welcome to new toy. Up on the bed, Woody see a shiny, snazzy new Buzz Lightyear, space ranger toy. Oh, boy. Buzz starts to look around and press buttons on his suit. He believes he's crashed landed on a strange planet and his ship (his box) is destroyed. When Woody finally says 'hello' Buzz blasts him with his red laser light, which, of course, doesn't do anything except glow. Woody welcomes Buzz to Andy's room and explains there's been a little mix-up. See, Buzz is sitting on Woody's spot on the bed. The other toys crawl up on the bed and meet Buzz, too. They're seriously impressed with him. He's got all kind of cool buttons and lights and sounds. Woody doesn't have any of those things. Buzz tells the group he's a space ranger who's crash-landed on their planet, but Woody corrects him. Buzz is a toy, just like all of them. It's not like he can fly like a real space ranger or anything. Buzz begs to differ. He is not a toy. And he can fly. Woody dares Buzz to go ahead and show them. Buzz steps to the edge of the bed and jumps off. Instead of hitting the ground, he bounces off a ball and onto a racetrack where he zooms towards the ceiling and catches onto a little plane that's spinning around there. Finally, he lands safely on the bed. The other toys are super-impressed, but Woody is annoyed. He tells everyone that that wasn't really flying. It was just 'falling with style.' Buzz goes off with the other toys, but Woody tells us he's not worried. Buzz's reign won't last long. After all, Woody is Andy's favorite toy, right?",
    "script": "BEAT\n\nThe toys slowly come to life and make their way toward the bed.\n\n                         MR. POTATO HEAD\n            What is it?\n\n                         BO PEEP\n            Can you see it?\n\n                         SLINKY\n            What the heck is up there?\n\n                         REX\n            Woody?  Who's up there with you?\n\nWoody crawls out from under the bed.  The toys are shocked\nto discover him there.\n\n                         SLINKY\n            Woody, what are you doing under the\n            bed?\n\n                         WOODY\n                   (composing himself)\n            Uh-h-h-h...nothing!  Uh, nothing.\n            I'm sure Andy was just a little\n            excited, that's all.  Too much cake\n            and ice cream, I suppose.  It's\n            just a mistake.\n\n                         MR. POTATO HEAD\n            Well, that MISTAKE is sitting in\n            your spot, Woody.\n\n                         REX\n                   (GASP!)\n            Have you been replaced?\n\n                         WOODY\n            Hey!  What did I tell you earlier?\n            No one is getting replaced.\n\nThe toys give each other a look of doubt.\n\n                         WOODY\n            Now let's all be polite, and give\n            whatever it is up there a nice, big\n            'Andy's Room' welcome.\n\nWoody climbs slowly up the side of the bed, peeking over the\nedge.  His eyes widen at the sight of...\n\nBUZZ LIGHTYEAR\n\nWe see Buzz as Woody does - an expensive looking space age\naction figure, covered with buttons and stickers from head\nto toe.  The imposing 'G.I. Joe-sized' doll stands heroically\nin the center of the bed, his back to Woody.\n\nWoody GULPS.\n\nBuzz comes alive and looks around.\n\nANGLE: BUZZ'S POV THROUGH HIS HELMET\n\nWhile he scans the bedroom a 'DARTH VADER' LIKE BREATHING is\nheard.\n\nBuzz eyes it all suspiciously and pushes a button on his chest.\n\nSFX: ELECTRONIC BEEP\n\n                         BUZZ\n            Buzz Lightyear to Star Command.\n            Come in, Star Command.\n\nNothing.  He pushes the button again.\n\n                         BUZZ\n            Star Command - come in.  Do you\n            read me?\n                   (to himself)\n            Why don't they answer?!!\nJust then, Buzz catches sight of his ripped packaging.  The\nbox is designed to look like a spaceship.\n\n                         BUZZ\n                   (GASP)\n            My ship!!\n\nHe runs up to the box and investigates the damage.\n\n                         BUZZ\n            Blast!  This'll take weeks to repair!\n\nBuzz flips open a plastic compartment on his arm -- his\nwrist communicator.\n\n                         BUZZ\n            Buzz Lightyear Mission Log.\n            Stardate 4072: My ship has run off\n            course en route to sector 12.  I've\n            crash landed on a strange planet.\n            The impact must have awoken me from\n            hyper-sleep.\n\nBuzz springs up and down on the squishy surface of the bed.\n\n                         BUZZ\n                   (into communicator)\n            Terrain seems a bit unstable...\n\nHe taps the sticker of controls on his wrist communicator.\n\n                         BUZZ\n                   (into communicator)\n            No read-out yet if the air is\n            breathable... and there seems to be\n            no sign of intelligent life\n            anywhere --\n\nANGLE: BUZZ'S POV THROUGH HIS HELMET\n\nWoody's face suddenly pops into view.\n\n                         WOODY\n            Hello-o-o...\n\n                         BUZZ\n            HO-YAAAHH!!!\n\nBuzz jumps back, taking a fighting stance.  He presses a\nbutton on his arm that turns on a red 'laser beam' light on\nhis wrist.  Buzz aims the red beam on Woody's forehead and\nholds it there.\n\n                         WOODY\n            Aaaaaaah!  Whoa, hey, whoa, did I\n            frighten you?  Didn't mean to.\n            Sorry.  Howdy!  My name is Woody\n            and this is Andy's room.  That's\n            all I wanted to say, and also,\n            there has been a bit of a mix-up.\n            This is my spot, see, the bed here --\n\nWhile Woody is speaking, Buzz notices the sheriff's badge on\nWoody's vest.\n\n                         BUZZ\n                   (de-activating his\n                   laser beam)\n            Local law enforcement!  It's about\n            time you got here.  I'm Buzz\n            Lightyear, Space Ranger, Universe\n            Protection Unit.  My ship has crash\n            landed here by mistake.\n\nBuzz begins walking around the bed, surveying the situation.\nWoody tries to keep up.\n\n                         WOODY\n            Yes, it is a mistake, because, you\n            see, the bed, here, is my spot.\n\n                         BUZZ\n            I need to repair my turbo boosters.\n            Do you people still use fossil\n            fuels, or have you discovered\n            crystalic fusion?\n\n                         WOODY\n            Well, let's see, we've got double\n            A's --\n\n                         BUZZ\n            Watch yourself!!\n\nBuzz shoves Woody down on the bed and re-activates his wrist\nlaser.\n\n                         BUZZ\n                   (continued)\n            Halt!  Who goes there?!\n\nThe other toys are peeking over the edge of the bed.\n\n                         REX\n            Don't shoot!  It's okay!  Friends!\n\n                         BUZZ\n                   (to Woody)\n            Do you know these life forms?\n\n                         WOODY\n            Yes.  They're Andy's toys.\n\n                         BUZZ\n            Alright, everyone.  You're clear to\n            come up.\n\nBuzz walks over to the toys.\n\n                         BUZZ\n            I am Buzz Lightyear.  I come in peace.\n\nRex steps forward and eagerly shakes Buzz's hand.\n\n                         REX\n            Oh, I'm so glad you're not a dinosaur!\n\n                         BUZZ\n            Why, thank you...\n                   (pulls away)\n            Now thank you all for your kind\n            welcome.\n\n                         REX\n            Say!  What's that button do?\n\n                         BUZZ\n            I'll show you.\n\nBuzz presses a button on his chest.\n\n                         BUZZ (SAMPLED VOICE)\n            Buzz Lightyear to the rescue!\n\nThe toys all GASP IN AWE.\n\n                         SLINKY\n            Hey, Woody's got something like\n            that.  His is a pullstring, only\n            it --\n\n                         MR. POTATO HEAD\n            Only it sounds like a car ran over it.\n\n                         HAMM\n            Oh yeah, but not like this one.\n            This is a quality sound system.\n            Probably all copper wiring, huh?\n            So, uh, where are you from?\n            Singapore?  Hong Kong?\n\n                         BUZZ\n            Well...no, actually I'm stationed\n            up in the Gamma Quadrant of Sector\n            4.  As a member of the elite\n            Universe Protection Unit of the\n            Space Ranger Corps, I protect the\n            galaxy from the threat of invasion\n            from the Evil Emperor Zurg, sworn\n            enemy of the Galactic Alliance.\n\nAs Buzz speaks, Woody glances down at the box in which Buzz\narrived.\n\nANGLE: BACK OF BUZZ'S BOX\n\nThere is a cartoon drawing of Buzz giving the exact, word-\nfor-word spiel that Buzz is now giving.\n\n                         MR. POTATO HEAD\n            Oh, really?  I'm from Playskool.\n\n                         REX\n            And I'm from Mattel.  Well, I'm not\n            actually  from Mattel, I'm actually\n            from a smaller company that was\n            purchased in a leveraged buy-out.\n            Well, I don't really understand the\n            financials, but...\n\nWoody walks over to Bo Peep.\n\n                         WOODY\n            You'd think they've never seen a\n            new toy before.\n\n                         BO PEEP\n            Well sure, look at him.  He's got\n            more gadgets on him then a Swiss\n            army knife.\n\nSlinky presses the button on Buzz's arm, activating his\nlaser light.  Buzz quickly pulls his arm away.\n\n                         BUZZ\n            Ah, ah, ah, please be careful!  You\n            don't want to be in the way when my\n            laser goes off.\n\n                         MR. POTATO HEAD\n            Hey, a laser!  How come you don't\n            have a laser, Woody?\n\n                         WOODY\n            It's not a laser!  It's a little\n            lightbulb that blinks!\n\n                         HAMM\n            What's with him?\n\n                         MR. POTATO HEAD\n            Laser-envy.\n\n                         WOODY\n            All right, that's enough.  Look,\n            we're all very impressed with\n            Andy's new toy --\n\n                         BUZZ\n            Toy?\n\n                         WOODY\n            T-O-Y.  Toy.\n\n                         BUZZ\n            Excuse me, I think the word you're\n            searching for is Space Ranger.\n\n                         WOODY\n            The word I'm searching for I can't\n            say because there's pre-school toys\n            present.\n\n                         MR. POTATO HEAD\n            Gettin' kind of tense, aren't you?\n\n                         REX\n            Oh, uh, Mr. Lightyear?  Now I'm\n            curious.  What does a Space Ranger\n            actually do?\n\n                         WOODY\n            He's not a Space Ranger!  He\n            doesn't fight evil or shoot lasers\n            or fly --\n\n                         BUZZ\n            Excuse me.\n\nBuzz calmly hits a button and wings pop out.\n\nAgain the toys GASP IN AWE.\n\n                         HAMM\n            Oh, impressive wingspan.  Very good!\n\n                         WOODY\n            Oh, what?!...What?!  These are\n            plastic.  He can't fly!\n\n                         BUZZ\n            They are a terillium-carbonic alloy\n            and I CAN fly.\n\n                         WOODY\n            No, you can't.\n\n                         BUZZ\n            Yes, I can.\n\n                         WOODY\n            You can't!\n\n                         BUZZ\n            Can!\n\n                         WOODY\n            Can't!  Can't!  Can't!\n\n                         BUZZ\n            I tell you, I could fly around this\n            room with my eyes closed!\n\n                         WOODY\n            Okay then, Mr. Lightbeer!  Prove it.\n\n                         BUZZ\n            All right, then, I will.\n                   (to toys)\n            Stand back everyone!\n\nThe crowd of toys make room for Buzz as he heads towards the\nedge of the bed and climbs up the bedpost.  He poses like a\nhigh diver, shuts his eyes...\n\n                         BUZZ\n            To infinity and beyond!!\n\n...and leaps off the bed.\n\nBuzz plummets straight down, hits a big rubber ball and\nbounces right back up.\n\nHe then lands on a Hotwheels car, which races him down the\ntrack, through the loop, and off a ramp.  Buzz soars upward\ninto a plane mobile hanging from the ceiling.\n\nBuzz becomes wedged between the plane's wheels.  The impact\nturns on the PLANE'S MOTOR making it (and Buzz) spin around\nand around.\n\nAll the other toys watch from the bed, mesmerized.\n\nFinally the centrifugal force causes Buzz to separate from\nthe plane, sailing him across the room toward the bed.\n\nBuzz makes a perfect landing right in front of Woody and\nthen opens his eyes.\n\n                         BUZZ\n            Can.\n\nThe crowd of toys rush Buzz, CHEERING AND CLAPPING WITH\nADORATION.\n\n                         REX\n            Whoa!  Oh, wow!  You flew\n            magnificently!\n\n                         BO PEEP\n            I found my moving buddy!\n\n                         BUZZ\n            Why, thank you.  Thank you all.\n            Thank you.\n\n                         WOODY\n            That wasn't flying!  That was\n            falling with style!\n\n                         MR. POTATO HEAD\n            Man, the dolls must really go for\n            you!\n                   (aside)\n            Can you teach me that?\n\nWoody stands alone at the other end of the bed, fuming.\nSlinky, caught up in the euphoria, approaches Woody.\n\n                         SLINKY\n            Heh, heh, heh!  Golly bob howdy --\n\n                         WOODY\n            Oh, shut up!  In a couple of days,\n            everything will be just the way it\n            was.  They'll see... they'll see.\n            I'm still Andy's favorite toy.\n"
  }],
  "links": [{
    "characterNode": "Andy",
    "source": 2,
    "target": 11,
    "value": 2
  }, {
    "characterNode": "Mr. Potato Head",
    "source": 4,
    "target": 11,
    "value": 2
  }, {
    "characterNode": "Little Bo Peep",
    "source": 3,
    "target": 11,
    "value": 2
  }, {
    "characterNode": "Sheriff Woody",
    "source": 0,
    "target": 11,
    "value": 4
  }, {
    "characterNode": "Molly",
    "source": 6,
    "target": 11,
    "value": 4
  }, {
    "characterNode": "Slinky",
    "source": 9,
    "target": 11,
    "value": 4
  }, {
    "characterNode": "Rex",
    "source": 10,
    "target": 11,
    "value": 4
  }, {
    "characterNode": "Andy",
    "source": 11,
    "target": 12,
    "value": 4
  }, {
    "characterNode": "Sheriff Woody",
    "source": 11,
    "target": 12,
    "value": 4
  }, {
    "characterNode": "Molly",
    "source": 11,
    "target": 12,
    "value": 4
  }, {
    "characterNode": "Mrs. Davis",
    "source": 5,
    "target": 12,
    "value": 4
  }, {
    "characterNode": "Sheriff Woody",
    "source": 12,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Mr. Potato Head",
    "source": 11,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Little Bo Peep",
    "source": 11,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Slinky",
    "source": 11,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Rex",
    "source": 11,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Hamm",
    "source": 7,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Sarge",
    "source": 8,
    "target": 13,
    "value": 4
  }, {
    "characterNode": "Sheriff Woody",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Mr. Potato Head",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Little Bo Peep",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Slinky",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Rex",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Hamm",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Sarge",
    "source": 13,
    "target": 14,
    "value": 4
  }, {
    "characterNode": "Sheriff Woody",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Mr. Potato Head",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Little Bo Peep",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Slinky",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Rex",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Hamm",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Sarge",
    "source": 14,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Andy",
    "source": 12,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Buzz Lightyear",
    "source": 1,
    "target": 15,
    "value": 4
  }, {
    "characterNode": "Sheriff Woody",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Mr. Potato Head",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Little Bo Peep",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Slinky",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Rex",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Hamm",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Sarge",
    "source": 15,
    "target": 16,
    "value": 4
  }, {
    "characterNode": "Buzz Lightyear",
    "source": 15,
    "target": 16,
    "value": 4
  }]
}